Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ན་དབང་པོ་ལྔ་པོ་དག་ལྷན་ཅིག་ཏུ་འབྲེལ་པ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད། ལུང་བསྟན་པའི་ས་ཡང་ཐོབ་པར་བྱེད་དེ། འདི་ལྟ་སྟེ། དཔེར་ན་ཕྱི་རོལ་གྱི་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དག་མངལ་ན་འདུག་པ་བུད་མེད་དང་སྐྱེས་པའི་དབང་པོར་མ་གྱུར་གྱི་བར་དུ་མངལ་ན་འདུག་པ་ལ་ལུང་མི་སྟོན་པ་དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་ལྔ་པོ་དེ་དག་དང་མི་ལྡན་གྱི་བར་དུ་ལུང་མི་སྟོན་ཏེ དེ་ནི་ལམ་ཡན་ལག་ལྔ་པའོ། །
en: “In this way, these five faculties are intimately connected. They bring about the mastery of all the perfect buddha qualities and lead to the attainment of the stage of receiving a prediction of awakening. Those who possess the five external superior abilities do not make predictions about a being who has been conceived in the womb until the fetus has developed the faculties of the female or male gender. In the same way, the lords, the buddhas, do not make predictions about a bodhisatva until he has developed these five faculties.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ཡན་ལག་ལྔ་པ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This is what is known as the fivefold path, and this is how the bodhisatva who is skilled in the fivefold path practices the perfection of wisdom.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ལམ་ཡན་ལག་ལྔ་ལ་མཁས་པ་གང་ཞེ་ན། ཡན་ལག་ལྔ་ནི་འདི་ལྟ་སྟེ། དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་སོ། །
en: “Śāriputra, there is another fivefold path that the bodhisatvas are skilled in. What are the five elements of this path? They are the power of faith, the power of vigor, the power of mindfulness, the power of concentration, and the power of wisdom.

source: དེ་ལ་དད་པའི་སྟོབས་གང་ཞེ་ན། གང་མོས་པ་དད་པ་མགོ་གཅིག་པ་མི་རྫི་བ་སྟེ་གལ་ཏེ་དེའི་དྲུང་དུ་བདུད་སྡིག་ཅན་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་བསྒྱུར་ཏེ་འོངས་ནས། ཆོས་ཀྱི་ཡེ་ཤེས་ལ་དད་པ་གང་ཡང་རུང་བ་ལ་ལ་ཞིག་གིས་ཆོས་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་ཡིན་ནོ། ། ཞེས་འབྲལ་བར་བྱེད། འདུན་པ་ཟློག་པར་བྱེད་ཀྱང་ཡོངས་སུ་བརྟག་པ་བཟུང་ན་འབྱུང་བ་ཆེན་པོ་བཞི་རྣམས་ནི་གཞན་དུ་འགྱུར་གྱི། དད་པའི་སྟོབས་ལ་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་ལས་འབྲལ་བར་མི་ནུས་པ་དེ་ནི་དད་པའི་སྟོབས་སོ། །
en: “What is the power of faith? It is the kind of motivation that comes from trust, that is one-pointed, and that cannot be crushed. If the evil Māra were to approach the bodhisatva in the guise of a buddha discourage and dissuade him in any number of ways from cultivating an interest in knowledge of the Dharma, saying, ‘This teaching is not the teaching of the Buddha,’ and even if he could make it appear that the four major elements had been transformed, he would still not be able to separate him from the power of his faith, because of his confidence in the power of faith. This is what is known as the bodhisatva’s power of faith.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་གང་ཞེ་ན། གང་བརྩོན་འགྲུས་རྩོམ་ཞིང་དགེ་བའི་ཆོས་གང་དང་གང་ལ་མངོན་པར་སྦྱོར་བ་དེ་དང་དེ་དག་ལ་བརྟན་པའི་སྟོབས་ཀྱི་མཐུ་ཐོབ་ཀྱང་གནས་དེར་མ་བསྒྲལ་གྱི་བར་དུ་སྟོབས་ཀྱི་མཐུ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་རྣམས་ཀྱིས་རྣམ་པར་བཟློག་པ་འམ་བསྟན་པ་འམ། རྣམ་པར་བསླང་བར་མི་ནུས་ཏེ དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཞེས་བྱའོ། །
en: “What is the power of vigor? It is such that when he applies himself with vigor, engaging with any kind of wholesome qualities and achieving an effective powerful stability in them, the world with its gods cannot stop this effective power. It cannot influence him until he comes out of this state. This is what is known as the power of vigor.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་དྲན་པའི་སྟོབས་གང་ཞེ་ན། ཆོས་གང་དག་ལ་དྲན་པ་ཉེ་བར་གཞག་པས་སེམས་ཉེ་བར་གཞག་པ་སྟེ། དེ་ནི་ཉོན་མོངས་པ་གང་ཡང་རུང་བ་དག་གིས་གཏོར་བ་འམ་གཡེང་བར་མི་ནུས་ཏེ། དྲན་པའི་སྟོབས་བསྐྱེད་པ་དེས་ཉོན་མོངས་པ་ཐམས་ཅད་འཛོམས་ཤིང་དྲན་པ་དེ་ཡང་མི་ཆོམས་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དྲན་པའི་སྟོབས་ཞེས་བྱའོ། །
en: “What is the bodhisatva’s power of mindfulness? Whatever he takes as the object of the application of his mindfulness, there is no kind of vice whatsoever that can throw him off or make him lose his focus. With this kind of power of mindfulness, he can crush all disruptions. His mindfulness is indestructible. This is what is known as the bodhisatva’s power of mindfulness.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་གང་ཞེ་ན། གང་འདུ་འཛི་ཐམས་ཅད་དབེན་པར་སྤྱོད་པ་སྟེ། གང་དག་གི་ལམ་གྱི་སྒྲ་ཐམས་ཅད་ལ་ཡང་རྟོག་ལ་དེའི་བསམ་གཏན་དང་པོའི་སྒྲའི་ཚེར་མ་ལ་སྒྲིབ་པར་མི་བྱེད་པ་དང་། དགེ་བར་རྟོག་པ་ལ་ཡང་རྣམ་པར་རྟོག་མོད་ཀྱི་བསམ་གཏན་གཉིས་པ་ལ་ཡང་སྒྲིབ་པར་མི་འགྱུར་བ་དང་། དེ་དགའ་བ་དང་། བདེ་བ་སྐྱེས་ཏེ་ གནས་མོད། དེའི་བསམ་གཏན་གསུམ་པ་ལ་ཡང་སྒྲིབ་པར་མི་འགྱུར་བ་དང་། དེ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བྱ་བའི་ཕྱིར་བཏང་སྙོམས་པ་ཡང་མ་ཡིན་མོད་ཀྱི། བསམ་གཏན་བཞི་པ་ལ་ཡང་སྒྲིབ་པར་མི་འགྱུར་བ་སྟེ། དེ་བསམ་གཏན་དེ་བཞི་ལ་གནས་ན་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པས་གཞོམ་པར་མི་ནུས་ཏེ། དེ་ནི་ཏིང་ངེ་འཛིན་གྱི་གནས་ཀྱང་མི་གཏོང་ལ་ཏིང་ངེ་འཛིན་གྱི་དབང་གིས་ཀྱང་མི་སྐྱེ་བ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་སོ། །
en: “What is the bodhisatva’s power of concentration? It is to dwell secluded from any kind of company. He masters all forms of verbal communication but does not let the thicket of words become an obscuration to the first meditative state. He continues to actively recognize what is wholesome, but this does not obscure the second meditative state. He remains happy and joyful, but this does not obscure the third meditative state. He does not remain indifferent to bringing sentient beings to maturity or preserving the true teachings, but this does not obscure the fourth meditative state. As he dwells in these four meditative states, he cannot possibly be hampered by factors that stand in opposition to meditation. He does not abandon his state of concentration, yet he does not use his power of concentration to gain rebirth. This is the bodhisatva’s power of concentration.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་སྟོབས་གང་ཞེ་ན། གང་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཀྱིས་མི་ཆོམས་པའི་ཡེ་ཤེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེས་མ་ཐག་ཏུ་བཟོའི་གནས་འཇིག་རྟེན་ན་ཇི་སྙེད་སྤྱོད་པ་དམ་པ་དང་། དགའ་བར་བྱེད་པ་དང་། རྙེད་དཀའ་བ་དེ་དག་ཐམས་ཅད་སློབ་དཔོན་མེད་པར་མངོན་དུ་འགྱུར་ཏེ། གང་འཇིག་རྟེན་ལས་འདས་པ་དག་ཀྱང་གང་གིས་འཇིག་རྟེན་དག་སྒྲོལ་བར་བྱེད་དེ། དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་བྱུང་བ་ལྷ་དང་མི་རྣམས་ཀྱིས་མི་ཆོམས་པ་སྟེ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་སྟོབས་སོ། །
en: “What is the bodhisatva’s power of wisdom? It is a knowledge that cannot be destroyed by any worldly or transcendental factors. Immediately after his birth, even though he has no teacher, the bodhisatva will display all kinds of worldly skills and abilities, however outstanding, challenging, or difficult they may be. The transcendental, too, which brings liberation from the world, arises within the bodhisatva by means of the power of wisdom and knowledge, and it cannot be crushed by the world with its gods, humans, and asuras. This is what is known as the bodhisatva’s power of wisdom.

source: འདི་ནི་ཡན་ལག་ལྔ་པའི་ལམ་གཞན་ནོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡན་ལག་ལྔ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “This is the other path that includes five elements, and this is how the bodhisatva who is skilled in the fivefold path practices the perfection of wisdom.

source: གཞན་ཡང་མདོར་བསྡུ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ནི་མགོ་གཅིག་པ་སྟེ། དེ་ནས་ལམ་བགྲོད་པ་གཅིག་པའོ། ། འདི་ལྟ་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་གཉིས་སུ་མེད་པ་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གྲོགས་མེད་པར་ཤིན་ཏུ་བརྩོན་པའི་སྟོབས་ཀྱི་མཐུ་ཡོངས་སུ་གཟུང་བའི་བསམ་པས་གོ་ཆ་བགོས་པ་སྟེ། གཞན་གྱིས་མ་བསྟན་པ། གཞན་གྱིས་དྲིང་མི་འཇོག་པ། བདག་ཉིད་བྱེད་པ། བདག་གིས་སྟོབས་ཀྱིས་ཡང་དག་པར་འཕགས་པ་སྟེ། དེ་ལྟར་གོ་ཆ་སྲབ་བགོས་ནས་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མ་ཐོབ་པ་དེ་བདག་གིས་ཐོབ་པར་བྱའོ། ། གང་འཕགས་པ་ཐམས་ཅད་དང་། གང་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་མ་ཐོབ་པ་དེ་བདག་གིས་ཐོབ་པར་བྱའོ། ། སྦྱིན་པ་ནི་ངའི་གྲོགས་མ་ཡིན་གྱི། ང་ནི་སྦྱིན་པའི་གྲོགས་སོ། ། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ནི་ངའི་གྲོགས་མ་ཡིན་གྱི་ང་ནི་དེ་དག་གི་གྲོགས་སོ། ། ང་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་བསླང་བར་བྱ་བ་མ་ཡིན་གྱི། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ངས་བསླང་བར་བྱའོ། ། གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་རྒྱས་པར་ཤེས་པར་བྱའོ། ། ང་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་བསླང་བར་བྱ་བ་མ་ཡིན་གྱི། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ངས་བསླང་བར་བྱའོ། ། ཞེས་དེ་ལྟ་བུའི་ཆོས་རྣམས་ལ་གྲོགས་མེད་ཅིང་ང་གཅིག་པུ་གཉིས་སུ་མེད་པར་རྡོ་རྗེའི་གདན་ལ་འདུག་ནས་བདུད་སྟོབས་དང་བཅས་པ་བཏུལ་ཏེ། སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། ། ཞེས་དེ་ལ་ངེས་པར་རྟོགས་པ་བསམ་པའི་སྦྱོར་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའི་ལམ་བགྲོད་པ་གཅིག་པུ་ཞེས་བྱ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ལམ་བགྲོད་པ་གཅིག་པུ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ལ་མཁས་པ་སྟེ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ལ་མཁས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “Furthermore, if this is condensed there is a bodhisatva path that has only one element. It is the path that is traversed alone. This means that the bodhisatva is alone, with no other companions, as he sets out for unsurpassed perfect awakening. He has a vigorous, strong, powerful motivation. He is not guided by anyone else. He is not reliant on others. He works alone. His own qualities are fully developed. Such is the strength of the armor they don: ‘We will help sentient beings to attain what they cannot attain. We will help all the noble ones and all those bodhisatvas who have newly entered into the vehicle to attain what they cannot attain. Generosity is not my companion. I am the companion of generosity. Morality, patient acceptance, vigor, meditation, and wisdom are not my companions. I am their companion. I am not supported by the perfections. It is the perfections that are supported by me. All the roots of virtue, as listed above, may be inserted here to illustrate this point. I am not supported by the roots of virtue. All the roots of virtue are supported by me. Proceeding with no companions in this way, I will be alone, with no one by my side, as I sit upon the vajra seat of awakening, conquer the powerful māras, and by means of the wisdom that arises in that one moment attain unsurpassed perfect awakening.’ This is the conviction that motivates them. This is what is known as the path of the bodhisatva that is traversed alone, and this is how the bodhisatva who is skilled in the path that is traversed alone practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པུ་དབེན་པར་སོང་སྟེ། ནང་དུ་ཡང་དག་བཞག་ནས་འདི་ལྟར་སེམས་ལ་རྟོག་པ་སྐྱེ་སྟེ། སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འདི་གང་ལས་འབྱུང་བར་འགྱུར་སྙམ་པ་དང་། དེ་འདི་ལྟར་སེམས་ཏེ། ཚུལ་བཞིན་མ་ཡིན་པ་བྱུང་བའི་ཕྱིར་མ་རིག་པ་འབྱུང་། མ་རིག་པ་བྱུང་བའི་ཕྱིར་འདུ་བྱེད་འབྱུང་། འདུ་བྱེད་བྱུང་བའི་ཕྱིར་རྣམ་པར་ཤེས་པ་འབྱུང་། རྣམ་པར་ཤེས་པ་བྱུང་བའི་ཕྱིར་མིང་དང་གཟུགས་འབྱུང་། མིང་དང་གཟུགས་བྱུང་བའི་ཕྱིར་སྐྱེ་མཆེད་དྲུག་འབྱུང་། སྐྱེ་མཆེད་དྲུག་བྱུང་བའི་ཕྱིར་རེག་པ་འབྱུང་། རེག་པ་བྱུང་བའི་ཕྱིར་ཚོར་བ་འབྱུང་། ཚོར་བ་བྱུང་བའི་ཕྱིར་སྲེད་པ་འབྱུང་། སྲེད་པ་བྱུང་བའི་ཕྱིར་ལེན་པ་འབྱུང་། ལེན་པ་བྱུང་བའི་ཕྱིར་སྲིད་པ་འབྱུང་། སྲིད་པ་བྱུང་བའི་ཕྱིར་སྐྱེ་བ་འབྱུང་། སྐྱེ་བ་བྱུང་བའི་ཕྱིར་རྒ་ཤི་འབྱུང་། རྒ་ཤི་བྱུང་བའི་ཕྱིར་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་འབྱུང་བར་འགྱུར་རོ་སྙམ་མོ། ། དེ་ཡང་འདི་ལྟར་སེམས་ཏེ། ཇི་ལྟར་མི་གཡོ་བ་དང་། མི་བྱེད་པ་དང་། བདག་པོ་མེད་པ་དང་། དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། མི་གཡོ་བའི་རྒྱུ་ལས་བྱུང་བ་དང་། མྱ་ངན་ལས་འདས་པའི་རྒྱུ་ལས་བྱུང་བའི་ཆོས་དེ་དག་ཐམས་ཅད་རྐྱེན་ལས་བྱུང་བ་སྟེ། གང་ཡང་ལས་ཀྱི་རྒྱུ་གང་དག་གིས་སེམས་ཅན་གང་དག་གི་དབང་པོའི་རྒྱུ་ཚད་མ་དང་། ལྷག་པའི་ཆོ་གའི་རྒྱུ་ཚད་མའི་འབྲས་བུའི་རྒྱུ་འགྲུབ་པ་དང་། དེ་ལྟར་ཟིན་པ་དང་། མ་ཟིན་པ་ལས་གང་རྒྱུ་འདུས་པ་བྱུང་བ་དེ་ཐམས་ཅད་རབ་ཏུ་ཤེས་པ་སྟེ།
en: “Now, what is the bodhisatvas’ skill in dependent origination? The bodhisatva retreats to a secluded place and absorbs himself in meditation, reflecting in the following way: ‘Where does the origin of this great mass of suffering come from?’ He answers, ‘The origin of ignorance comes from the origin of superficiality. The origin of mental conditioning comes from the origin of ignorance. The origin of consciousness comes from the origin of mental conditioning. The origin of name and form comes from the origin of consciousness. The origin of the six sense fields comes from the origin of name and form. The origin of contact comes from the origin of the six sense fields. The origin of feeling comes from the origin of contact. The origin of desire comes from the origin of feeling. The origin of grasping comes from the origin of desire. The origin of becoming comes from the origin of desire. The origin of birth comes from the origin of becoming. The origin of aging, death, pain, despair, suffering, depression, and struggle comes from the origin of birth.’ He continues, ‘This is how these phenomena come about. They are powerless, ineffective, and ownerless. They are causally related to what is wholesome, to what is unwholesome, to what is immovable, and to nirvāṇa. They are all created by conditions. It is the causes of a sentient being’s actions, their causal faculties, and their causal behavior that determines the causal result.’ These may be complete or not complete, and he understands that everything is related to how the sum of causes turns out. This is what is known as skill in dependent origination.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པ་ཞེས་བྱའོ། ། དེ་ཡང་གང་འགག་ཅེ་ན། ཚུལ་བཞིན་མ་ཡིན་པའི་ཡིད་ལ་བྱེད་པ་འགགས་པའི་ཕྱིར་མ་རིག་པ་འགག་གོ ། མ་རིག་པ་འགགས་པའི་ཕྱིར་འདུ་བྱེད་འགག་པ་ནས་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་གི་བར་དུ་འགག་པར་འགྱུར་རོ། །
en: “Then he thinks, ‘How can this be stopped? Ignorance can be stopped by stopping superficial mental application. Mental conditioning can be stopped by stopping ignorance, and so forth. In this way the whole great mass of suffering is stopped.’ Seeing things in this way is what is known as skill in dependent origination.

source: ཞེས་དེ་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་གང་དེ་ལ་ཤེས་པ་དེ་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པ་ཞེས་བྱའོ། ། དེ་ཡང་ཆོས་ཐམས་ཅད་ནི་རྒྱུ་ལ་རག་ལས། རྐྱེན་ལ་རག་ལས། འདུས་པ་ལ་རག་ལས་པ་སྟེ། གང་རྒྱུ་དང་། རྐྱེན་དང་། འདུས་པ་ལ་རག་ལས་པ་དེ་ནི་བདག་གི་བྱིན་གྱི་རླབས་མ་ཡིན། སྲོག་དང་གང་ཟག་གི་བྱིན་གྱི་རླབས་མ་ཡིན་ཏེ། དེ་ལ་བགྲང་བ་གང་ཡང་མེད་དོ། །
en: “He continues, thinking, ‘All phenomena are dependent on causes, dependent on conditions, and dependent on completeness. As they are dependent on causes, on conditions, and on completeness, there is no room for a self, no room for a life force or a person. These things cannot be calculated.’ To examine things in this way is what is known as skill in dependent origination.

source: ཞེས་དེ་ལྟར་སེམས་ཏེ། གང་དེ་ལྟར་སེམས་པ་དེ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པའོ། ། དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་རྣམ་པའི་རྐྱེན་དུ་སློང་བར་བྱེད་ལ། རྐྱེན་དེ་དག་ལ་ཡང་ཟད་པ་དང་། འགག་པར་སོ་སོར་རྟོག་ལ། སེམས་ཅན་ལ་ལྟ་བའི་ཕྱིར་ཟད་པ་དང་འགག་པ་མ་ཡིན་པ་ཡང་ཐོབ་པར་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མཁས་པའོ། །
en: “In this way, the bodhisatva sees clearly how the conditions that define awakening, and all the qualities of the Buddha, come about, and how these conditions are destroyed and halted. Because of his concern for all sentient beings, he does not allow them to be destroyed or halted. This is what is known as the bodhisatva’s skill in dependent origination, and this is how the bodhisatva who is skilled in dependent origination practices the perfection of wisdom.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། འདུས་བྱས་དང་འདུས་མ་བྱས་སོ། ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་འདུས་བྱས་དང་། འདུས་མ་བྱས་ལ་མཁས་པར་བྱ་སྟེ། དེ་ལ་འདུས་བྱས་ལ་མཁས་པ་གང་ཞེ་ན། གང་ལུས་ཀྱི་འདུ་བྱེད་དང་། ངག་གི་འདུ་བྱེད་དང་། ཡིད་ཀྱི་འདུ་བྱེད་དོ། ། གང་ལ་ལུས་དང་ངག་དང་། ཡིད་ཀྱི་དགེ་བའི་འདུ་བྱེད་ཀྱིས་འདུས་མ་བྱས་པའི་བྱང་ཆུབ་ལ་འདུས་མ་བྱས་པར་རྟོག་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྔོ་བ་དེ་ནི་འདུས་མ་བྱས་ལ་མཁས་པའོ། །
en: “Now, what is the bodhisatva’s skilled approach to all phenomena? All phenomena implies both the conditioned and the unconditioned, and the bodhisatva is skilled with respect to both the conditioned and the unconditioned. “To be skilled with respect to the conditioned is to be capable with regard to conditioned physical things, conditioned verbal things, and conditioned mental things. To transform conditioned physical, verbal, and mental virtues into unconditioned awakening by realizing the unconditioned is skill in the unconditioned.

source: གཞན་ཡང་འདུས་བྱས་ལ་མཁས་པ་ནི་འདི་ལྟ་སྟེ་གང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་རྣམས་སྡུད་པའོ། ། གང་ཡང་འདུས་མ་བྱས་པའི་ཤེས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་རྣམས་ཀྱིས་སྨོད་པར་མི་བྱེད་ཅིང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚོགས་ཐམས་ཅད་ལ་མཁས་པ་དང་། ཟག་པ་མེད་པའི་བྱང་ཆུབ་དེ་ལ་མོས་པས་གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྔོ་བ་དེ་ནི་དེའི་འདུས་མ་བྱས་ལ་མཁས་པའོ། །
en: “Moreover, to be skilled with respect to the conditioned is to master the five perfections—the perfections of generosity, morality, patient acceptance, vigor, and meditation—and also to not disparage the five perfections from the perspective of the perfection of wisdom, even though one has understood the unconditioned. To be skillful in amassing all the perfections while devoted to undefiled awakening, and to dedicate it to omniscience, is skill in the unconditioned.

source: གཞན་ཡང་འདུས་བྱས་ལ་མཁས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་འོད་ཟེར་ཐོགས་པ་མེད་པ་དང་། བསྡུ་བ་བཞིས་སེམས་ཅན་སྡུད་པའོ། ། གང་ཡང་སྙེམས་པ་མེད་པའི་ཕྱིར་སེམས་ཅན་ལ་བདག་མེད་པར་འཛིན་པ་དག་བསྡུ་བ་ལ་མཁས་ཤིང་འདུས་མ་བྱས་པའི་བྱང་ཆུབ་ལ་མོས་ནས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སྔོ་བ་དེ་ནི་དེའི་འདུས་མ་བྱས་ལ་མཁས་པའོ། །
en: “Moreover, to be skilled with respect to the conditioned is to radiate unimpeded rays of light to all sentient beings, gathering sentient beings together by using the four methods for bringing people together. Moreover, it is to maintain a skillful approach to the methods for bringing people together by not holding on to things, understanding that there is no being and no self. To be devoted to unconditioned awakening, and to dedicate oneself to it for the sake of omniscience, this is skill in the unconditioned.

source: གཞན་ཡང་འདུས་བྱས་ལ་མཁས་པ་ནི་གང་འཁོར་བའི་རྒྱུན་གྱི་ཀུན་ནས་སྦྱོར་བ་རྣམས་ཡང་དག་པར་མི་གཅོད་ལ་འཁོར་བའི་རྒྱུན་གྱི་ཉོན་མོངས་པ་རྣམས་ཡང་དག་པར་གཅོད་པ་དང་། བྱང་ཆུབ་ཏུ་དམིགས་པའི་སྦྱོར་བ་རྣམས་རྒྱུན་ཆགས་པར་བྱེད་པ་དང་། སྦྱོར་བ་ཕྱོགས་གཅིག་པ་རྣམས་མི་སྡུད་པར་སྤྱོད་པ་དེ་ནི་འདུས་བྱས་ལ་མཁས་པ་ཞེས་བྱའོ། ། གང་ཡང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྣམས་ལ་འདྲིས་པར་བྱ་བ་ཤེས་ཤིང་མངོན་སུམ་དུ་མཁས་པ་དང་། བྱང་ཆུབ་ཏུ་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་ཅིང་འདུས་མ་བྱས་ཀྱང་མངོན་དུ་མི་བྱེད་པ་དེ་ནི་འདུས་མ་བྱས་ལ་མཁས་པའོ། །
en: “Moreover, to be skilled with respect to the conditioned is to not cut off the link one has to the continuum of cyclic existence, while cutting off the vices that bind one to cyclic existence. It is to maintain one’s connection with the objective of awakening, but not to do so in a limited manner. This is what is known as skill in the conditioned. To be skilled in discerning the kind of knowledge that is familiar with emptiness, freedom from attributes, and freedom from aspirations, to not be dependent on others for awakening, and to not reify the unconditioned is what is known as skill in the unconditioned.

source: གཞན་ཡང་ཁམས་གསུམ་ན་སྤྱོད་ཀྱང་ཁམས་གསུམ་ན་སྤྱོད་པའི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་མི་གོས་པ་དེ་ནི་དེའི་འདུས་བྱས་ལ་མཁས་པའོ། ། གང་ཡང་ཁམས་གསུམ་ལས་འབྱུང་བའི་ཡེ་ཤེས་རབ་ཏུ་ཤེས་ཀྱང་འབྱུང་བའི་ཁམས་སུ་མི་ལྟུང་བ་དེ་ནི་འདུས་མ་བྱས་ལ་མཁས་པ་ཞེས་བྱའོ། ། གང་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: “Moreover, to engage with the three realms of existence while not being affected by the vices that are connected with the three realms is what is known as his skill in the conditioned. To have an understanding of the knowledge of how to escape from the three realms while not losing oneself in the state of deliverance is what is known as skill in the unconditioned.

source: གང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་རྟོགས་པ་ཡོངས་སུ་རྫོགས་པ་དེ་ནི་ཤེས་རབ་དང་། མཁས་པ་མེད་ན་འབྱུང་བར་མི་འགྱུར་བས་དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ལ་མཁས་པ་ཞེས་བྱ་སྟེ དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་ལ་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “The expression being skilled in all phenomena is a synonym for omniscience. Omniscience, the perfect realization of all knowledge, does not shine forth in the absence of wisdom and skill. This is why it is called skill in all phenomena, and this is how the bodhisatva who is skilled in all phenomena practices the perfection of wisdom.

source: ཤཱ་རིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ལ་གནས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཤེས་རབ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་ཤིང་མཁས་པ་བཅུ་པོ་དེ་དག་ལ་ཡང་མཁས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །
en: “In this way, Śāriputra, the bodhisatva, the great being, who has mastered The Collected Teachings on the Bodhisatva and who practices the perfection of wisdom is skilled in employing the analytical tools of wisdom and skilled in these ten kinds of skill in his practice of the perfection of wisdom.
